---
kind: type
id: T:Autodesk.Revit.DB.ElementReferenceType
source: html/f664c172-bb88-463b-d8ad-5dd70a11dd5a.htm
---
# Autodesk.Revit.DB.ElementReferenceType

Element reference types.

## Syntax (C#)
```csharp
public enum ElementReferenceType
```